"use strict";

/*
    1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в градусах по Фаренгейту.
    Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, Tc – температура  по Цельсию.
*/
let tempCel = 20;
let tempFar;
tempFar = (9 / 5) * tempCel + 32;
console.log('# 1');
console.log(`Температура по Цельсию: ${tempCel} градусов`);
console.log(`Температура по Фаренгейту: ${tempFar} градусов`);

/*
    2. Работа с переменными. Объявить две переменные: admin и name. Записать в name строку "Василий";
    Скопировать значение из name в admin. Вывести admin (должно вывести «Василий»).
*/
let name = 'Василий';
let admin;
admin = name;
console.log('# 2');
console.log(admin);

/*
    3. Чему будет равно JS-выражение 1000 + "108"
*/
console.log('# 3');
console.log(`JS-выражение 1000 + "108" = ${1000 + "108"}, т.к. происходит конкатенация и число приводится к строке`);

/*
    4. Самостоятельно разобраться с атрибутами тега script (async и defer)
*/
console.log('# 4');
console.log('Атрибуты async и defer позволяют выполнить скрипт асинхронно, не задерживая обработку страницы. ' +
    'Отличие в том, что в случае подключения нескольких скриптов с атрибутом defer, они будут выполняться по порядку ' +
    'и ждать, пока загружится вся html-страница. С async порядок будет зависить от того, какой скрипт быстрее загрузится. ' +
    'IE9 не поддерживает async.');